In [1]:
a=int(input("Enter number :"))
if a>1:
    for x in range(2,a):
        if(a%x)==0:
            print("Not prime")
            break
        else:
            print("Prime")
            break
else:
    print("Not prime")

Enter number :10
Not prime

In [4]:
a=int(input("Enter the terms :"))
f=0
s=1

if a<=0:
    print("The requested series is\n",f)
else:
    print(f,s,end=" ")
    for x in range(2,a):
        next=f+s
        print(next,end=" ")
        f=s
        s=next

Enter the terms :5
0 1 1 2 3

In [6]:
def pyfunc(r):
    for x in range(r):
        print(" "*(r-x-1)+"*"*(2*x+1))
pyfunc(4)

   *
  ***
 *****
*******

In [9]:
def bs(a):
    b=len(a)-1
    for x in range(b):
        for y in range(b-x):
            if a[y]>a[y+1]:
                a[y],a[y+1]=a[y+1],a[y]
    return a
a=[3,2,6,5,8,5]
bs(a)

[2, 3, 5, 5, 6, 8]

In [10]:
a=input("Enter sequence : ")
b=a[::-1]
if a==b:
    print("Palindrome")
else:
    print("Not palindrome")

Enter sequence : ababa
Palindrome

In [1]:
a=10
b=20.10
d=a+b
c="durva"
e=d+b
print(d)
print(e)
print(c)
print(a+b)

30.1
50.2
durva
30.1

In [2]:
r=10
p="abhay"
c=2023.12
print("What is your roll number : ",r)
print("What is your name : ",p)
print("What is your day salaries:",c)

What is your roll number :  10
What is your name :  abhay
What is your day salaries: 2023.12

In [3]:
a=10
b=20.10
d=a+b
c="durva"
e="integer"
print(e)

integer

In [4]:
list=[2,3.1,4,5,6,"Ram","Sachin"]
print(list)
print(list[1:3])
print(list[3:6])
print(list[:])

[2, 3.1, 4, 5, 6, 'Ram', 'Sachin']
[3.1, 4]
[5, 6, 'Ram']
[2, 3.1, 4, 5, 6, 'Ram', 'Sachin']

In [6]:
fruits=["apples","appleu","apple"]
for x in "fruits":
    print(x)
    if x== "apple":
        break

f
r
u
i
t
s

In [7]:
fruits=["apple","banana","cherry"]
for x in fruits:
    print(x)
    if x== "banana":
        break

apple
banana

In [8]:
fruits=["apple","banana","cherry"]
for x in fruits:
    print(x)

apple
banana
cherry

In [9]:
for x in "fruits":
    print(x)

f
r
u
i
t
s

In [10]:
fruits=["apple","banana","cherry"]
for x in fruits:
    if x== "apple":
        continue
    print(x)

banana
cherry

In [11]:
for x in range(20):
    print(x)

0
1
2
3
4
5
6
7
8
9
10
11
12
13
14
15
16
17
18
19

In [12]:
for x in range(5,1000):
    print(x)

5
6
7
8
9
10
11
12
13
14
15
16
17
18
19
20
21
22
23
24
25
26
27
28
29
30
31
32
33
34
35
36
37
38
39
40
41
42
43
44
45
46
47
48
49
50
51
52
53
54
55
56
57
58
59
60
61
62
63
64
65
66
67
68
69
70
71
72
73
74
75
76
77
78
79
80
81
82
83
84
85
86
87
88
89
90
91
92
93
94
95
96
97
98
99
100
101
102
103
104
105
106
107
108
109
110
111
112
113
114
115
116
117
118
119
120
121
122
123
124
125
126
127
128
129
130
131
132
133
134
135
136
137
138
139
140
141
142
143
144
145
146
147
148
149
150
151
152
153
154
155
156
157
158
159
160
161
162
163
164
165
166
167
168
169
170
171
172
173
174
175
176
177
178
179
180
181
182
183
184
185
186
187
188
189
190
191
192
193
194
195
196
197
198
199
200
201
202
203
204
205
206
207
208
209
210
211
212
213
214
215
216
217
218
219
220
221
222
223
224
225
226
227
228
229
230
231
232
233
234
235
236
237
238
239
240
241
242
243
244
245
246
247
248
249
250
251
252
253
254
255
256
257
258
259
260
261
262
263
264
265
266
267
268
269
270
271
272
273
274
275
276
277
278
279
280
281
282
283
284
285
286
287
288
289
290
291
292
293
294
295
296
297
298
299
300
301
302
303
304
305
306
307
308
309
310
311
312
313
314
315
316
317
318
319
320
321
322
323
324
325
326
327
328
329
330
331
332
333
334
335
336
337
338
339
340
341
342
343
344
345
346
347
348
349
350
351
352
353
354
355
356
357
358
359
360
361
362
363
364
365
366
367
368
369
370
371
372
373
374
375
376
377
378
379
380
381
382
383
384
385
386
387
388
389
390
391
392
393
394
395
396
397
398
399
400
401
402
403
404
405
406
407
408
409
410
411
412
413
414
415
416
417
418
419
420
421
422
423
424
425
426
427
428
429
430
431
432
433
434
435
436
437
438
439
440
441
442
443
444
445
446
447
448
449
450
451
452
453
454
455
456
457
458
459
460
461
462
463
464
465
466
467
468
469
470
471
472
473
474
475
476
477
478
479
480
481
482
483
484
485
486
487
488
489
490
491
492
493
494
495
496
497
498
499
500
501
502
503
504
505
506
507
508
509
510
511
512
513
514
515
516
517
518
519
520
521
522
523
524
525
526
527
528
529
530
531
532
533
534
535
536
537
538
539
540
541
542
543
544
545
546
547
548
549
550
551
552
553
554
555
556
557
558
559
560
561
562
563
564
565
566
567
568
569
570
571
572
573
574
575
576
577
578
579
580
581
582
583
584
585
586
587
588
589
590
591
592
593
594
595
596
597
598
599
600
601
602
603
604
605
606
607
608
609
610
611
612
613
614
615
616
617
618
619
620
621
622
623
624
625
626
627
628
629
630
631
632
633
634
635
636
637
638
639
640
641
642
643
644
645
646
647
648
649
650
651
652
653
654
655
656
657
658
659
660
661
662
663
664
665
666
667
668
669
670
671
672
673
674
675
676
677
678
679
680
681
682
683
684
685
686
687
688
689
690
691
692
693
694
695
696
697
698
699
700
701
702
703
704
705
706
707
708
709
710
711
712
713
714
715
716
717
718
719
720
721
722
723
724
725
726
727
728
729
730
731
732
733
734
735
736
737
738
739
740
741
742
743
744
745
746
747
748
749
750
751
752
753
754
755
756
757
758
759
760
761
762
763
764
765
766
767
768
769
770
771
772
773
774
775
776
777
778
779
780
781
782
783
784
785
786
787
788
789
790
791
792
793
794
795
796
797
798
799
800
801
802
803
804
805
806
807
808
809
810
811
812
813
814
815
816
817
818
819
820
821
822
823
824
825
826
827
828
829
830
831
832
833
834
835
836
837
838
839
840
841
842
843
844
845
846
847
848
849
850
851
852
853
854
855
856
857
858
859
860
861
862
863
864
865
866
867
868
869
870
871
872
873
874
875
876
877
878
879
880
881
882
883
884
885
886
887
888
889
890
891
892
893
894
895
896
897
898
899
900
901
902
903
904
905
906
907
908
909
910
911
912
913
914
915
916
917
918
919
920
921
922
923
924
925
926
927
928
929
930
931
932
933
934
935
936
937
938
939
940
941
942
943
944
945
946
947
948
949
950
951
952
953
954
955
956
957
958
959
960
961
962
963
964
965
966
967
968
969
970
971
972
973
974
975
976
977
978
979
980
981
982
983
984
985
986
987
988
989
990
991
992
993
994
995
996
997
998
999

In [13]:
for x in range(5,1000,9):
    print(x)

5
14
23
32
41
50
59
68
77
86
95
104
113
122
131
140
149
158
167
176
185
194
203
212
221
230
239
248
257
266
275
284
293
302
311
320
329
338
347
356
365
374
383
392
401
410
419
428
437
446
455
464
473
482
491
500
509
518
527
536
545
554
563
572
581
590
599
608
617
626
635
644
653
662
671
680
689
698
707
716
725
734
743
752
761
770
779
788
797
806
815
824
833
842
851
860
869
878
887
896
905
914
923
932
941
950
959
968
977
986
995

In [1]:
list=["apple",999,"cherry"]
print(list)

['apple', 999, 'cherry']

In [2]:
list=["apple","banana","cherry","orange","kiwi","melon","mango"]
print(list[3:])
print(type(list))

['orange', 'kiwi', 'melon', 'mango']
<class 'list'>

In [3]:
list=["apple","banana","cherry","orange","kiwi","melon","mango"]
print(list[-6:-5])

['banana']

In [4]:
list=["apple","banana","cherry"]
list[-2]="blackcurrant"
print(list)

['apple', 'blackcurrant', 'cherry']

In [5]:
list=["apple","123","cherry"]
for x in "list":
    print(x)

l
i
s
t

In [6]:
list=["apple","banana","cherry"]
list.append("banana")
print(list)

['apple', 'banana', 'cherry', 'banana']

In [7]:
list=["apple","banana","cherry"]
list.append("Banana")
print(list)

['apple', 'banana', 'cherry', 'Banana']

In [8]:
list=["apple","banana","cherry","orange","kiwi","melon","mango"]
print(list[-6:5])

['banana', 'cherry', 'orange', 'kiwi']

In [9]:
list=["apple","banana","cherry","orange","kiwi","melon","mango"]
print(list[:-10])

[]

In [10]:
list=["apple","banana","cherry","orange","kiwi","melon","mango"]
print(list[-5:-15])

[]

In [12]:
list=["apple","banana","cherry"]
list.insert(2,"orange")
print(list)
print(list[2])

['apple', 'banana', 'orange', 'cherry']
orange

In [13]:
list=["apple","banana","cherry"]
list.remove("banana")
print(list)

['apple', 'cherry']

In [14]:
list=["apple","banana","cherry"]
list.pop()
print(list)

['apple', 'banana']

In [15]:
list=["apple","banana","cherry"]
del list[-2]
print(list)

['apple', 'cherry']

In [16]:
list=["apple","banana","cherry"]
list.clear()
print(list)

[]

In [17]:
fruits=("apple","banana","cherry")
print(fruits)
print(type(fruits))

('apple', 'banana', 'cherry')
<class 'tuple'>

In [18]:
fruits=("apple","banana","cherry","orange","kiwi","melon","mango")
print(fruits[-2:3])

()

In [19]:
fruits=("apple","banana","cherry","orange","kiwi","melon","mango")
print(fruits[3:-7])

()

In [20]:
fruits=("apple","banana","cherry","orange","kiwi","melon","mango")
print(fruits[4:-2])

('kiwi',)

In [21]:
fruits=("apple","banana","cherry","orange","kiwi","melon","mango")
print(fruits[-4:-7])

()

In [22]:
fruits=("apple","banana","cherry","orange","kiwi","melon","mango")
for x in "mutuple":
    print(x)

m
u
t
u
p
l
e

In [23]:
fruits=("apple","banana","cherry","orange","kiwi","melon","mango")
print(len(fruits))

7

In [25]:
fruits=("apple","banana","cherry","orange","kiwi","melon","mango")
fruits.pop()
print(fruits)

AttributeError: 'tuple' object has no attribute 'pop'

In [1]:
tuple1=("a","b","2")
tuple2=(1,2,3)
tuple3=tuple2+tuple1
print(tuple3)

(1, 2, 3, 'a', 'b', '2')

In [2]:
thistuple=tuple(("apple","banana","cherry"))
print(thistuple)

('apple', 'banana', 'cherry')

In [2]:
myset = {"Durva", "amar", "ankita","sagar","rahul","pooja","Mahi","viru"}
print(myset)

{'Mahi', 'Durva', 'amar', 'viru', 'sagar', 'rahul', 'ankita', 'pooja'}

In [4]:
myset = {"Durva", "amar", "ankita","sagar","rahul","mahi","pooja","viru"}
for x in myset:
    print(x)

Durva
mahi
amar
viru
sagar
rahul
ankita
pooja

In [5]:
myset = {"Durva","sagar","rahul","Pooja","Mahi","viru"}
print("Rahul" in myset)

False

In [6]:
myset = {"Durva", "amar", "ankita","rahul","pooja","Mahi","viru"} #Add an item to a set
myset.add("orange")
myset.add("Mangos")
myset.add("orange")
myset.add("Bluee")
print(myset)

{'Mahi', 'rahul', 'Bluee', 'Durva', 'Mangos', 'amar', 'orange', 'viru', 'pooja', 'ankita'}

In [7]:
myset = {"Durva", "amar", "ankita","sagar","rahul","pooja","Mahi","viru"} 
myset.update(["orange", "mango", "grapes"])
print(myset)

{'Mahi', 'Durva', 'mango', 'amar', 'grapes', 'orange', 'viru', 'sagar', 'rahul', 'ankita', 'pooja'}

In [8]:
myset = {"Durva", "amar", "ankita","sagar","rahul","pooja","Mahi","viru"}
print(len(myset))

8

In [11]:
myset = {"ankita","rahul","pooja","viru"}
myset.remove('sagar')
print(myset)

KeyError: 'sagar'

In [10]:
myset = {"ankita","rahul","pooja","Mahi","viru"}
myset.discard("sagar")
print(myset)

{'Mahi', 'rahul', 'viru', 'pooja', 'ankita'}

In [12]:
myset = {"pooja","Mahi","viru","AMAR","adi","Ankita","rahul","Krishna"}
x = myset.pop()
print(x)
print(myset)

Ankita
{'Mahi', 'rahul', 'Krishna', 'AMAR', 'viru', 'pooja', 'adi'}

In [13]:
myset = {"Durva", "amar", "ankita","sagar","rahul","pooja","Mahi","viru"}
myset.clear()
print(myset)

set()

In [14]:
set1 = {"Durva", "amar", "ankita","sagar","rahul","pooja","Mahi","viru"}
set2 = {1, 2, 3}
set3 = set1.union(set2)
print(set3)

{'Mahi', 1, 2, 'Durva', 3, 'amar', 'viru', 'sagar', 'rahul', 'ankita', 'pooja'}

In [15]:
set1 = {"Durva", "Amar", "Ankita"}
set2 = {1, 2, 3}
set1.update(set2)
print(set1)

{'Ankita', 1, 'Amar', 2, 'Durva', 3}

In [16]:
a=set()
b={}
c=[]
print(type(a))
print(type(b))
print(type(c))

<class 'set'>
<class 'dict'>
<class 'list'>

In [17]:
mydict = {
"Durva": "Developer",
"Amar": "Shopper",
"rack":"Python",
"year": 2020
}
print(mydict)

{'Durva': 'Developer', 'Amar': 'Shopper', 'rack': 'Python', 'year': 2020}

In [18]:
x = mydict["rack"]
x

'Python'

In [19]:
x = mydict.get("Amar")
x

'Shopper'

In [20]:
mydict = {
"Durva": ["Developaaaer","Developer"],
"Amar": "Shopkeeper",
"year": 2020
}
mydict["year"] = "Python Pro"

In [21]:
print(mydict)

{'Durva': ['Developaaaer', 'Developer'], 'Amar': 'Shopkeeper', 'year': 'Python Pro'}

In [23]:
for x in mydict:
    print(x)

Durva
Amar
year

In [24]:
for x in mydict:
    print(mydict[x])

['Developaaaer', 'Developer']
Shopkeeper
Python Pro

In [25]:
for x in mydict.values():
    print(x)

['Developaaaer', 'Developer']
Shopkeeper
Python Pro

In [26]:
for x, y in mydict.items():
    print(x, y)

Durva ['Developaaaer', 'Developer']
Amar Shopkeeper
year Python Pro

In [27]:
mydict = {
"Durva": "Developer",
"Amar": "Shopkeeper",
"year": 2020
}
if "Durva" in mydict.keys():
    print("Yes, in dictionary")
else:
    print("Yes not in dictionary")

Yes, in dictionary

In [28]:
print(len(mydict))

3

In [29]:
mydict = {
"Durva": "Developer",
"Amar": "Shopkeeper",
"year": 2020
}
mydict["color"] = "red"
print(mydict)

{'Durva': 'Developer', 'Amar': 'Shopkeeper', 'year': 2020, 'color': 'red'}

In [30]:
mydict = {
"Durva": "Developer",
"Amar": "Shopkeeper",
"year": 2020
}
mydict.pop("year")
print(mydict)

{'Durva': 'Developer', 'Amar': 'Shopkeeper'}

In [31]:
mydict = {
"111": "333",
"": "",
"year": 2020,
"rack":5555
}
x=mydict.popitem()
print(x)
print(mydict)

('rack', 5555)
{'111': '333', '': '', 'year': 2020}

In [32]:
mydict = {
"Durva": "Developer",
"Amar": "Shopkeeper",
"year": 2020
}
del mydict["Amar"]
print(mydict)

{'Durva': 'Developer', 'year': 2020}

In [33]:
mydict = {
"Durva": "Developer",
"Amar": "Shopkeeper",
"year": 2020
}
mydict.clear()
print(mydict)

{}

In [34]:
mydict = {
"Durva": "Developer",
"Amar": "Shopkeeper",
"year": 2020
}
mydict1 = mydict.copy()
print(mydict)
print(mydict1)

{'Durva': 'Developer', 'Amar': 'Shopkeeper', 'year': 2020}
{'Durva': 'Developer', 'Amar': 'Shopkeeper', 'year': 2020}

In [35]:
mydict = {
"Durva": "Developer",
"Amar": "Shopkeeper",
"year": 2020
}
mydict2 = dict(mydict)
print(mydict2)

{'Durva': 'Developer', 'Amar': 'Shopkeeper', 'year': 2020}

In [2]:
a = 300
b = 40
if a< b:
    print("b is greater than a")
else:
    print("b is not greater than a")

b is not greater than a

In [3]:
a = 33
b = 20.0
if b > a:
    print("b is greater than a") 
else:
    print("b is not greater than a")

b is not greater than a

In [4]:
a = 30333
b = 300
c = 230
if b < a and c < b :
    print("b is greater than a")
elif b < a or a>b:
    print("a is less than b")
elif b == a:
    print("b is less than a")
else:
    print("a equals b")

b is greater than a

In [7]:
a = 200
b = 330
if b > a:
    print("b is greater than a")
elif a < b:
    print("a and b are equal")
else:
    print("a is greater than b")

b is greater than a

In [6]:
a = 200
b = 33
if b < a:
    print("b is greater than a")
else:
    print("b is not greater than a")

b is greater than a

In [8]:
a = 20022
b = 3302
if a > b: print("a is greater than b")

a is greater than b

In [9]:
a = 2
b = 1
print("A") if a > b else print("B")

A

In [10]:
a = 340
b = 3300
print("A") if a > b else print("=") if a == b else print("B")

B

In [12]:
a=int(input("enter the value"))
b=int(input("enter the value"))
c=a*b
print("The Value is: ",c)
print(type(c))

enter the value10
enter the value10
The Value is:  100
<class 'int'>

In [14]:
a=10
c="222"
print(type(c))
print(type(a))
a=str(a)
print(type(a))
c=int(c)
print(type(c))
s=20
s=str(20)
print(type(s))

<class 'str'>
<class 'int'>
<class 'str'>
<class 'int'>
<class 'str'>

In [15]:
a = 200
b = 3030
c = 500
if c > b or b > a:
    print("At least one of the conditions is True")
else:
    print("Its totally wrong")

At least one of the conditions is True

In [16]:
a = 200
b = 33
c = 500
if a > b or a > c:
    print("At least one of the conditions is True")
else:
    print("Its totally wrong")

At least one of the conditions is True

In [17]:
x = 0
if x > 10:
    print("Above ten,")
if x > 20:
    print("and also above 20!")
else:
    print("but not above 20.")

but not above 20.

In [18]:
i = 1
while i <= 100:
    print(i)
    i += 5

1
6
11
16
21
26
31
36
41
46
51
56
61
66
71
76
81
86
91
96

In [19]:
i = 1
while i <= 6:
    print(i)
    if i == 5:
        break
    i += 1

1
2
3
4
5

In [20]:
i = 0
while i < 6:
    i += 1
    if i == 58:
        continue
    print(i)

1
2
3
4
5
6

In [21]:
i = 1
while i < 6:
    print(i)
    i += 1
else:
    print("i is no longer less than 6")

1
2
3
4
5
i is no longer less than 6

In [22]:
fruits = ["apple", "banana", "cherry"]
for x in "apple":
    print(x)

a
p
p
l
e

In [23]:
for x in fruits:
    print(x)

apple
banana
cherry

In [24]:
fruits = ["apple", "banana", "cherry"]
for x in fruits:
    print(x)
    if x == "banana":
        break

apple
banana

In [25]:
fruits = ["apple", "banana", "cherry"]
for x in fruits:
    if x == "banana":
        break
    print(x)

apple

In [26]:
fruits = ["apple", "banana", "cherry"]
for x in fruits:
    if x == "banana":
        continue
    print(x)

apple
cherry

In [27]:
for x in range(6):
    print(x)

0
1
2
3
4
5

In [28]:
for x in range(2, 6):
    print(x)

2
3
4
5

In [29]:
for x in range(2, 30, 3):
    print(x)

2
5
8
11
14
17
20
23
26
29

In [30]:
for x in range(6):
    print(x)
else:
    print("Finally finished!")

0
1
2
3
4
5
Finally finished!

In [31]:
adj = ["red", "big", "tasty"]
fruits = ["apple", "banana", "cherry"]
for x in adj:
    for y in fruits:
        print(x, y)

red apple
red banana
red cherry
big apple
big banana
big cherry
tasty apple
tasty banana
tasty cherry

In [32]:
cars = ["Ford", "Volvo", "BMW"]

In [33]:
x = cars[2]
x

'BMW'

In [34]:
cars[0] = "Toyota"

In [35]:
cars

['Toyota', 'Volvo', 'BMW']

In [36]:
x = len(cars)
x

3

In [37]:
cars.append("Honda")
cars

['Toyota', 'Volvo', 'BMW', 'Honda']

In [38]:
cars.append("Kia")
cars

['Toyota', 'Volvo', 'BMW', 'Honda', 'Kia']

In [39]:
p=cars.pop(1)
print(p)
print(cars)

Volvo
['Toyota', 'BMW', 'Honda', 'Kia']

In [40]:
cars.remove("Toyota")
cars

['BMW', 'Honda', 'Kia']

In [41]:
x = lambda a : a / 5
print(x(50))

10.0

In [42]:
x = lambda a, b : a / b
print(x(15, 3))

5.0

In [43]:
x = lambda a, b, c : a * b * c
print(x(5, 6.1, 2))

61.0

In [44]:
def myfun(n):
    return lambda a : a * n
x = myfun(5)
print(x(11))

55

In [45]:
def myfunc(n):
    return lambda a : a * n
x = myfunc(2)
y = myfunc(3)
print(x(11))
print(y(21))

22
63

In [46]:
def rack():
    print("Hello from a function")
rack()

Hello from a function

In [47]:
def rack():
    print("a function")
rack()
def Durva():
    print("a Durva developers")
Durva()

a function
a Durva developers

In [48]:
def rack(fname):
    print(fname + ": Developers")
rack("Software")
rack("Machine")
rack("Network")

Software: Developers
Machine: Developers
Network: Developers

In [49]:
def rack(fname,lname):
    print(fname + " has sir name " +lname)
rack("Durva"," Wedpathak")

Durva has sir name  Wedpathak

In [50]:
def rack(c1,c2,c3):
    print("Who is the Younger:"+ c3)
rack(c1="Durva", c2="Amar",c3="Ankita")

Who is the Younger:Ankita

In [51]:
def dance(city="jaysingpur"):
    print("I am From "+city)
dance(" Sangli ")
dance(" Kolhapur ")

I am From  Sangli
I am From  Kolhapur

In [52]:
def dance(stack):
    for x in stack:
        print(x)
lists=["hipHop","Amar","Amit"]
dance(lists)

hipHop
Amar
Amit

In [53]:
def dance(x):
    return 10*x
print(dance(5))

50

In [54]:
def dance(stack):
    if stack >= 10:
        print(" Value is Right",stack)
    else:
        print(" Value is Wrong ",stack)
print(dance(9))

 Value is Wrong  9
None

In [55]:
class Dance:
    x=10

In [56]:
d1=Dance()
print(d1.x)

10

In [60]:
class Person:
    def __init__(self,name,age,a,b):
        self.name=name
        self.age=age
        self.a=a
        self.b=b
    def dance(self):
        print("This is my name",self.name)
    def adds(self):
        print("ans:",self.a+self.b)
p1=Person("Amit",25,10,2)
p1.dance()
p1.adds()

This is my name Amit
ans: 12

In [61]:
class SoftClass:
    x = 100
    y = 100
p1 = SoftClass()
print(p1.x)
print(p1.y)

100
100

In [62]:
class Maxclass:
    def __init__ (self, name, age):
        self.name = name
        self.age = age
p1 = Maxclass("Durva Wedpathak", 28)
print(p1.name)
print(p1.age)

Durva Wedpathak
28

In [64]:
class Maxclass:
    def __init__ (self, name, age):
        self.name = name
        self.age = age
    def myfunc(self):
        print("Hello my name is " + self.name)
p1 = Maxclass("John", 36)
del p1.age
print(p1.name)

John

In [65]:
class emp:
    empc=0
    def __init__ (self,name,salary):
        self.name=name
        self.salary=salary
        emp.empc +=1
    def displayC(self):
        print("Total Emp % d" %employee.empc)
    def displayEmp(self):
        print("Name:",self.name,"Salary:",self.salary)
emp1=emp("Amar",5000)
emp2=emp("Ankita",5500)
emp1.displayEmp()
emp2.displayEmp()
print("Total Emp %d"%emp.empc)

Name: Amar Salary: 5000
Name: Ankita Salary: 5500
Total Emp 2

In [66]:
class Person:
    def __init__ (self, name, age,address):
        self.name = name
        self.age = age
        self.address = address
    def myfunc(self):
        print("Hello my name is " + self.name,self.age)
    def myfuncc(self):
        print("Hello my name is " + self.address)
    def cal(self,a,b):
        print("Addition=",(int(a)+int(b)))
    def cals(self,d):
        if(int(d)%2==0):
            print("Even")
        else:
            print("Odd")
p1 = Person("John", 36,"jsp")
p2=Person("amar",32,"sangli")
p1.myfunc()
p2.myfuncc()
a=input("enter value")
b=input("enter value")
p1.cal(a,b)
a=input("enter value")
p1.cals(a)

Hello my name is John 36
Hello my name is sangli
enter value10
enter value20
Addition= 30
enter value5
Odd

In [5]:
n=int(input("enter the value"))
for x in range(n):
    if(x==35):
        {
        print("the student is pass")
        }

enter the value40
the student is pass

In [4]:
n=[70,55,80,34,35]
for x in n:
    if(x>=35):
        {
            print("the student is pass")
        }
    else:
        print("the student is fail")

the student is pass
the student is pass
the student is pass
the student is fail
the student is pass

In [7]:
a=int(input("enter the value"))
b=int(input("enter the value"))
for x in range(a,b):
    print("the value:",x)

enter the value10
enter the value20
the value: 10
the value: 11
the value: 12
the value: 13
the value: 14
the value: 15
the value: 16
the value: 17
the value: 18
the value: 19

In [8]:
x=int(input("enter the value"))
y=int(input("enter the value"))
z=int(input("enter the value"))
ac=int(input("enter the value"))
for ab in range(x,y,z):
    print("the value:",ab)
    if(ab==ac):
        print("the person allow to go")
    else:
        print("the person is not allow ")

enter the value10
enter the value20
enter the value30
enter the value40
the value: 10
the person is not allow

In [9]:
x=int(input("enter the value"))
y=int(input("enter the value"))
z=int(input("enter the value"))
ac=int(input("enter the value"))
for ab in range(x,y,z):
    print("the value:",ab)
    if(ab==ac):
        print("the person allow to go",ab)
    else:
        print("the person is not allow ",ab)

enter the value10
enter the value20
enter the value5
enter the value30
the value: 10
the person is not allow  10
the value: 15
the person is not allow  15

In [5]:
import numpy as np
import pandas as pd

In [9]:
df=pd.read_csv(r"C:\Users\OJUS\OneDrive\Desktop\PlayTennis.csv")

In [10]:
df.head()

    Outlook Temperature Humidity    Wind Play Tennis
0     Sunny         Hot     High    Weak          No
1     Sunny         Hot     High  Strong          No
2  Overcast         Hot     High    Weak         Yes
3      Rain        Mild     High    Weak         Yes
4      Rain        Cool   Normal    Weak         Yes

In [11]:
df.tail()

     Outlook Temperature Humidity    Wind Play Tennis
9       Rain        Mild   Normal    Weak         Yes
10     Sunny        Mild   Normal  Strong         Yes
11  Overcast        Mild     High  Strong         Yes
12  Overcast         Hot   Normal    Weak         Yes
13      Rain        Mild     High  Strong          No

In [12]:
df.head(10)

    Outlook Temperature Humidity    Wind Play Tennis
0     Sunny         Hot     High    Weak          No
1     Sunny         Hot     High  Strong          No
2  Overcast         Hot     High    Weak         Yes
3      Rain        Mild     High    Weak         Yes
4      Rain        Cool   Normal    Weak         Yes
5      Rain        Cool   Normal  Strong          No
6  Overcast        Cool   Normal  Strong         Yes
7     Sunny        Mild     High    Weak          No
8     Sunny        Cool   Normal    Weak         Yes
9      Rain        Mild   Normal    Weak         Yes

In [13]:
df.tail(10)

     Outlook Temperature Humidity    Wind Play Tennis
4       Rain        Cool   Normal    Weak         Yes
5       Rain        Cool   Normal  Strong          No
6   Overcast        Cool   Normal  Strong         Yes
7      Sunny        Mild     High    Weak          No
8      Sunny        Cool   Normal    Weak         Yes
9       Rain        Mild   Normal    Weak         Yes
10     Sunny        Mild   Normal  Strong         Yes
11  Overcast        Mild     High  Strong         Yes
12  Overcast         Hot   Normal    Weak         Yes
13      Rain        Mild     High  Strong          No

In [2]:
import numpy as np
import pandas as pd
df=pd.read_csv(r"C:\Users\OJUS\OneDrive\Desktop\\DS\Data Set\pvp_dataset.csv")

In [2]:
df

,year,name,party,term,salary,position_title
0,1789,"Washington,George",Unaffiliated,First,25000,PRESIDENT OF THE UNITED STATES
1,1790,"Washington,George",Unaffiliated,First,25000,PRESIDENT OF THE UNITED STATES
2,1791,"Washington,George",Unaffiliated,First,25000,PRESIDENT OF THE UNITED STATES
3,1792,"Washington,George",Unaffiliated,First,25000,PRESIDENT OF THE UNITED STATES
4,1793,"Washington,George",Unaffiliated,Second,25000,PRESIDENT OF THE UNITED STATES
...,...,...,...,...,...,...
424,2016,"Biden,Joseph Robinette,Jr.",Democratic,Second,230700,VICE PRESIDENT OF THE UNITED STATES
425,2017,"Pence,Michael Richard",Republican,First,230700,VICE PRESIDENT OF THE UNITED STATES
426,2018,"Pence,Michael Richard",Republican,First,230700,VICE PRESIDENT OF THE UNITED STATES
427,2019,"Pence,Michael Richard",Republican,First,235100,VICE PRESIDENT OF THE UNITED STATES
428,2020,"Pence,Michael Richard",Republican,First,235100,VICE PRESIDENT OF THE UNITED STATES

In [7]:
df.year

0      1789
1      1790
2      1791
3      1792
4      1793
       ...
424    2016
425    2017
426    2018
427    2019
428    2020
Name: year, Length: 429, dtype: int64

In [3]:
df.name

0               Washington,George
1               Washington,George
2               Washington,George
3               Washington,George
4               Washington,George
                  ...
424    Biden,Joseph Robinette,Jr.
425         Pence,Michael Richard
426         Pence,Michael Richard
427         Pence,Michael Richard
428         Pence,Michael Richard
Name: name, Length: 429, dtype: object

In [8]:
df.party

0      Unaffiliated
1      Unaffiliated
2      Unaffiliated
3      Unaffiliated
4      Unaffiliated
           ...
424      Democratic
425      Republican
426      Republican
427      Republican
428      Republican
Name: party, Length: 429, dtype: object

In [9]:
df.term

0       First
1       First
2       First
3       First
4      Second
        ...
424    Second
425     First
426     First
427     First
428     First
Name: term, Length: 429, dtype: object

In [10]:
df.salary

0       25000
1       25000
2       25000
3       25000
4       25000
        ...
424    230700
425    230700
426    230700
427    235100
428    235100
Name: salary, Length: 429, dtype: int64

In [11]:
df.position_title

0           PRESIDENT OF THE UNITED STATES
1           PRESIDENT OF THE UNITED STATES
2           PRESIDENT OF THE UNITED STATES
3           PRESIDENT OF THE UNITED STATES
4           PRESIDENT OF THE UNITED STATES
                      ...
424    VICE PRESIDENT OF THE UNITED STATES
425    VICE PRESIDENT OF THE UNITED STATES
426    VICE PRESIDENT OF THE UNITED STATES
427    VICE PRESIDENT OF THE UNITED STATES
428    VICE PRESIDENT OF THE UNITED STATES
Name: position_title, Length: 429, dtype: object

In [4]:
df.describe()

              year         salary
count   429.000000     429.000000
mean   1906.090909   76741.025641
std      68.454457   96592.308496
min    1789.000000    5000.000000
25%    1845.000000   12000.000000
50%    1909.000000   30000.000000
75%    1967.000000  100000.000000
max    2020.000000  400000.000000

In [6]:
df.max()

year                                             2020
name                            Wilson,Thomas Woodrow
party                                            Whig
term                                            Third
salary                                         400000
position_title    VICE PRESIDENT OF THE UNITED STATES
dtype: object

In [12]:
df.min()

year                                        1789
name                                  Adams,John
party                                 Democratic
term                                       First
salary                                      5000
position_title    PRESIDENT OF THE UNITED STATES
dtype: object

In [13]:
df.mean()

year       1906.090909
salary    76741.025641
dtype: float64

In [14]:
df.median()

year       1909.0
salary    30000.0
dtype: float64

In [15]:
df.std()

year         68.454457
salary    96592.308496
dtype: float64

In [16]:
df.dropna()

,year,name,party,term,salary,position_title
0,1789,"Washington,George",Unaffiliated,First,25000,PRESIDENT OF THE UNITED STATES
1,1790,"Washington,George",Unaffiliated,First,25000,PRESIDENT OF THE UNITED STATES
2,1791,"Washington,George",Unaffiliated,First,25000,PRESIDENT OF THE UNITED STATES
3,1792,"Washington,George",Unaffiliated,First,25000,PRESIDENT OF THE UNITED STATES
4,1793,"Washington,George",Unaffiliated,Second,25000,PRESIDENT OF THE UNITED STATES
...,...,...,...,...,...,...
424,2016,"Biden,Joseph Robinette,Jr.",Democratic,Second,230700,VICE PRESIDENT OF THE UNITED STATES
425,2017,"Pence,Michael Richard",Republican,First,230700,VICE PRESIDENT OF THE UNITED STATES
426,2018,"Pence,Michael Richard",Republican,First,230700,VICE PRESIDENT OF THE UNITED STATES
427,2019,"Pence,Michael Richard",Republican,First,235100,VICE PRESIDENT OF THE UNITED STATES
428,2020,"Pence,Michael Richard",Republican,First,235100,VICE PRESIDENT OF THE UNITED STATES

In [3]:
df.groupby("term")[["salary"]].mean()

               salary
term
First    67675.320513
Second  101833.628319
Third    75000.000000

In [4]:
df[10:20]

,year,name,party,term,salary,position_title
10,1799,"Adams,John",Federalist,First,25000,PRESIDENT OF THE UNITED STATES
11,1800,"Adams,John",Federalist,First,25000,PRESIDENT OF THE UNITED STATES
12,1801,"Jefferson,Thomas",Democratic-Republican,First,25000,PRESIDENT OF THE UNITED STATES
13,1802,"Jefferson,Thomas",Democratic-Republican,First,25000,PRESIDENT OF THE UNITED STATES
14,1803,"Jefferson,Thomas",Democratic-Republican,First,25000,PRESIDENT OF THE UNITED STATES
15,1804,"Jefferson,Thomas",Democratic-Republican,First,25000,PRESIDENT OF THE UNITED STATES
16,1805,"Jefferson,Thomas",Democratic-Republican,Second,25000,PRESIDENT OF THE UNITED STATES
17,1806,"Jefferson,Thomas",Democratic-Republican,Second,25000,PRESIDENT OF THE UNITED STATES
18,1807,"Jefferson,Thomas",Democratic-Republican,Second,25000,PRESIDENT OF THE UNITED STATES
19,1808,"Jefferson,Thomas",Democratic-Republican,Second,25000,PRESIDENT OF THE UNITED STATES

In [6]:
df_term=df.groupby("term")
df_term.mean()

               year         salary
term
First   1902.375000   67675.320513
Second  1915.061947  101833.628319
Third   1942.500000   75000.000000

In [10]:
df["salary"]

0       25000
1       25000
2       25000
3       25000
4       25000
        ...
424    230700
425    230700
426    230700
427    235100
428    235100
Name: salary, Length: 429, dtype: int64

In [11]:
df[["term","salary"]]

       term  salary
0     First   25000
1     First   25000
2     First   25000
3     First   25000
4    Second   25000
..      ...     ...
424  Second  230700
425   First  230700
426   First  230700
427   First  235100
428   First  235100

[429 rows x 2 columns]

In [13]:
df_sal=df[df["salary"]>200000]
df_sal

,year,name,party,term,salary,position_title
212,2001,"Bush,George Walker",Republican,First,400000,PRESIDENT OF THE UNITED STATES
213,2002,"Bush,George Walker",Republican,First,400000,PRESIDENT OF THE UNITED STATES
214,2003,"Bush,George Walker",Republican,First,400000,PRESIDENT OF THE UNITED STATES
215,2004,"Bush,George Walker",Republican,First,400000,PRESIDENT OF THE UNITED STATES
216,2005,"Bush,George Walker",Republican,Second,400000,PRESIDENT OF THE UNITED STATES
217,2006,"Bush,George Walker",Republican,Second,400000,PRESIDENT OF THE UNITED STATES
218,2007,"Bush,George Walker",Republican,Second,400000,PRESIDENT OF THE UNITED STATES
219,2008,"Bush,George Walker",Republican,Second,400000,PRESIDENT OF THE UNITED STATES
220,2009,"Obama,Barack Hussein,II",Democratic,First,400000,PRESIDENT OF THE UNITED STATES
221,2010,"Obama,Barack Hussein,II",Democratic,First,400000,PRESIDENT OF THE UNITED STATES
222,2011,"Obama,Barack Hussein,II",Democratic,First,400000,PRESIDENT OF THE UNITED STATES
223,2012,"Obama,Barack Hussein,II",Democratic,First,400000,PRESIDENT OF THE UNITED STATES
224,2013,"Obama,Barack Hussein,II",Democratic,Second,400000,PRESIDENT OF THE UNITED STATES
225,2014,"Obama,Barack Hussein,II",Democratic,Second,400000,PRESIDENT OF THE UNITED STATES
226,2015,"Obama,Barack Hussein,II",Democratic,Second,400000,PRESIDENT OF THE UNITED STATES
227,2016,"Obama,Barack Hussein,II",Democratic,Second,400000,PRESIDENT OF THE UNITED STATES
228,2017,"Trump,Donald John",Republican,First,400000,PRESIDENT OF THE UNITED STATES
229,2018,"Trump,Donald John",Republican,First,400000,PRESIDENT OF THE UNITED STATES
230,2019,"Trump,Donald John",Republican,First,400000,PRESIDENT OF THE UNITED STATES
231,2020,"Trump,Donald John",Republican,First,400000,PRESIDENT OF THE UNITED STATES
412,2004,"Chaney,Richard Bruce",Republican,First,203000,VICE PRESIDENT OF THE UNITED STATES
413,2005,"Chaney,Richard Bruce",Republican,Second,208100,VICE PRESIDENT OF THE UNITED STATES
414,2006,"Chaney,Richard Bruce",Republican,Second,212100,VICE PRESIDENT OF THE UNITED STATES
415,2007,"Chaney,Richard Bruce",Republican,Second,215700,VICE PRESIDENT OF THE UNITED STATES
416,2008,"Chaney,Richard Bruce",Republican,Second,221100,VICE PRESIDENT OF THE UNITED STATES
417,2009,"Biden,Joseph Robinette,Jr.",Democratic,First,227300,VICE PRESIDENT OF THE UNITED STATES
418,2010,"Biden,Joseph Robinette,Jr.",Democratic,First,230700,VICE PRESIDENT OF THE UNITED STATES
419,2011,"Biden,Joseph Robinette,Jr.",Democratic,First,230700,VICE PRESIDENT OF THE UNITED STATES
420,2012,"Biden,Joseph Robinette,Jr.",Democratic,First,230700,VICE PRESIDENT OF THE UNITED STATES
421,2013,"Biden,Joseph Robinette,Jr.",Democratic,Second,230700,VICE PRESIDENT OF THE UNITED STATES
422,2014,"Biden,Joseph Robinette,Jr.",Democratic,Second,230700,VICE PRESIDENT OF THE UNITED STATES
423,2015,"Biden,Joseph Robinette,Jr.",Democratic,Second,230700,VICE PRESIDENT OF THE UNITED STATES
424,2016,"Biden,Joseph Robinette,Jr.",Democratic,Second,230700,VICE PRESIDENT OF THE UNITED STATES
425,2017,"Pence,Michael Richard",Republican,First,230700,VICE PRESIDENT OF THE UNITED STATES
426,2018,"Pence,Michael Richard",Republican,First,230700,VICE PRESIDENT OF THE UNITED STATES
427,2019,"Pence,Michael Richard",Republican,First,235100,VICE PRESIDENT OF THE UNITED STATES
428,2020,"Pence,Michael Richard",Republican,First,235100,VICE PRESIDENT OF THE UNITED STATES

In [14]:
import numpy as np
import pandas as pd
df=pd.read_csv(r"C:\Users\OJUS\OneDrive\Desktop\\DS\Data Set\data_dictionary.csv")

In [18]:
df

,College Abbreviation,Meaning,Notes,Undergraduate College
0,Business,Grossman School of Business,NaN,Yes
1,CALS,College of Agriculture and Life Sciences,NaN,Yes
2,CAS,College of Arts and Sciences,NaN,Yes
3,CEMS,College of Engineering and Mathematical Sciences,NaN,Yes
4,CESS,College of Education and Social Services,NaN,Yes
5,CNHS,College of Nursing and Health Sciences,NaN,Yes
6,COM,College of Medicine,NaN,No
7,Department of Ext,UVM Extension,NaN,No
8,LCOMEO,NaN,"Probably means ""Larner College of Medicine: Co...",No
9,Learning and Info Tech,NaN,Only used by one faculty; seems to be related ...,No
10,Library,UVM Libraries,"Includes employees of Howe Library, Dana Medic...",No
11,RSENR,Rubenstein School of Environment and Natural R...,NaN,Yes

In [20]:
df.Meaning

0                           Grossman School of Business
1              College of Agriculture and Life Sciences
2                          College of Arts and Sciences
3      College of Engineering and Mathematical Sciences
4              College of Education and Social Services
5                College of Nursing and Health Sciences
6                                   College of Medicine
7                                         UVM Extension
8                                                   NaN
9                                                   NaN
10                                        UVM Libraries
11    Rubenstein School of Environment and Natural R...
Name: Meaning, dtype: object

In [21]:
df.describe()

,College Abbreviation,Meaning,Notes,Undergraduate College
count,12,10,3,12
unique,12,10,3,2
top,Business,UVM Extension,Only used by one faculty; seems to be related ...,Yes
freq,1,1,1,7

In [22]:
df.max()

College Abbreviation     RSENR
Undergraduate College      Yes
dtype: object

In [23]:
df.min()

College Abbreviation     Business
Undergraduate College          No
dtype: object

In [24]:
df.mean()

Series([], dtype: float64)

In [25]:
df.median()

Series([], dtype: float64)

In [26]:
df.std()

Series([], dtype: float64)

In [27]:
df.dropna()

,College Abbreviation,Meaning,Notes,Undergraduate College
10,Library,UVM Libraries,"Includes employees of Howe Library, Dana Medic...",No

In [17]:
df.groupby("Undergraduate College")[["College Abbreviation"]].max()

                      College Abbreviation
Undergraduate College
No                                 Library
Yes                                  RSENR

In [18]:
df[10:20]

,College Abbreviation,Meaning,Notes,Undergraduate College
10,Library,UVM Libraries,"Includes employees of Howe Library, Dana Medic...",No
11,RSENR,Rubenstein School of Environment and Natural R...,NaN,Yes

In [23]:
df_ug=df.groupby(["Undergraduate College"])
df_ug.describe()

                      College Abbreviation                                 \
                                     count unique                top freq
Undergraduate College
No                                       5      5  Department of Ext    1
Yes                                      7      7               CEMS    1

                      Meaning         \
                        count unique
Undergraduate College
No                          3      3
Yes                         7      7

                                                                               \
                                                                     top freq
Undergraduate College
No                                                         UVM Libraries    1
Yes                    Rubenstein School of Environment and Natural R...    1

                      Notes         \
                      count unique
Undergraduate College
No                        3      3
Yes                       0      0


                                                                     top freq
Undergraduate College
No                     Includes employees of Howe Library, Dana Medic...    1
Yes                                                                  NaN  NaN

In [24]:
df[["Meaning","Notes"]]

,Meaning,Notes
0,Grossman School of Business,NaN
1,College of Agriculture and Life Sciences,NaN
2,College of Arts and Sciences,NaN
3,College of Engineering and Mathematical Sciences,NaN
4,College of Education and Social Services,NaN
5,College of Nursing and Health Sciences,NaN
6,College of Medicine,NaN
7,UVM Extension,NaN
8,NaN,"Probably means ""Larner College of Medicine: Co..."
9,NaN,Only used by one faculty; seems to be related ...
10,UVM Libraries,"Includes employees of Howe Library, Dana Medic..."
11,Rubenstein School of Environment and Natural R...,NaN

In [25]:
df_ug=df[df["Undergraduate College"]=="Yes"]
df_ug

,College Abbreviation,Meaning,Notes,Undergraduate College
0,Business,Grossman School of Business,NaN,Yes
1,CALS,College of Agriculture and Life Sciences,NaN,Yes
2,CAS,College of Arts and Sciences,NaN,Yes
3,CEMS,College of Engineering and Mathematical Sciences,NaN,Yes
4,CESS,College of Education and Social Services,NaN,Yes
5,CNHS,College of Nursing and Health Sciences,NaN,Yes
11,RSENR,Rubenstein School of Environment and Natural R...,NaN,Yes

In [26]:
import numpy as np
import pandas as pd
df=pd.read_csv(r"C:\Users\OJUS\OneDrive\Desktop\\DS\Data Set\pima-indians-diabetes.csv")

In [29]:
df

      6  148  72  35    0  33.6  0.627  50  1
0     1   85  66  29    0  26.6  0.351  31  0
1     8  183  64   0    0  23.3  0.672  32  1
2     1   89  66  23   94  28.1  0.167  21  0
3     0  137  40  35  168  43.1  2.288  33  1
4     5  116  74   0    0  25.6  0.201  30  0
..   ..  ...  ..  ..  ...   ...    ...  .. ..
762  10  101  76  48  180  32.9  0.171  63  0
763   2  122  70  27    0  36.8  0.340  27  0
764   5  121  72  23  112  26.2  0.245  30  0
765   1  126  60   0    0  30.1  0.349  47  1
766   1   93  70  31    0  30.4  0.315  23  0

[767 rows x 9 columns]

In [32]:
df.describe()

,6,148,72,35,0,33.6,0.627,50,1
count,767.000000,767.000000,767.000000,767.000000,767.000000,767.000000,767.000000,767.000000,767.000000
mean,3.842243,120.859192,69.101695,20.517601,79.903520,31.990482,0.471674,33.219035,0.348110
std,3.370877,31.978468,19.368155,15.954059,115.283105,7.889091,0.331497,11.752296,0.476682
min,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.078000,21.000000,0.000000
25%,1.000000,99.000000,62.000000,0.000000,0.000000,27.300000,0.243500,24.000000,0.000000
50%,3.000000,117.000000,72.000000,23.000000,32.000000,32.000000,0.371000,29.000000,0.000000
75%,6.000000,140.000000,80.000000,32.000000,127.500000,36.600000,0.625000,41.000000,1.000000
max,17.000000,199.000000,122.000000,99.000000,846.000000,67.100000,2.420000,81.000000,1.000000

In [33]:
df.max()

6         17.00
148      199.00
72       122.00
35        99.00
0        846.00
33.6      67.10
0.627      2.42
50        81.00
1          1.00
dtype: float64

In [34]:
df.min()

6         0.000
148       0.000
72        0.000
35        0.000
0         0.000
33.6      0.000
0.627     0.078
50       21.000
1         0.000
dtype: float64

In [35]:
df.mean()

6          3.842243
148      120.859192
72        69.101695
35        20.517601
0         79.903520
33.6      31.990482
0.627      0.471674
50        33.219035
1          0.348110
dtype: float64

In [36]:
df.median()

6          3.000
148      117.000
72        72.000
35        23.000
0         32.000
33.6      32.000
0.627      0.371
50        29.000
1          0.000
dtype: float64

In [37]:
df.std()

6          3.370877
148       31.978468
72        19.368155
35        15.954059
0        115.283105
33.6       7.889091
0.627      0.331497
50        11.752296
1          0.476682
dtype: float64

In [38]:
df.dropna()

      6  148  72  35    0  33.6  0.627  50  1
0     1   85  66  29    0  26.6  0.351  31  0
1     8  183  64   0    0  23.3  0.672  32  1
2     1   89  66  23   94  28.1  0.167  21  0
3     0  137  40  35  168  43.1  2.288  33  1
4     5  116  74   0    0  25.6  0.201  30  0
..   ..  ...  ..  ..  ...   ...    ...  .. ..
762  10  101  76  48  180  32.9  0.171  63  0
763   2  122  70  27    0  36.8  0.340  27  0
764   5  121  72  23  112  26.2  0.245  30  0
765   1  126  60   0    0  30.1  0.349  47  1
766   1   93  70  31    0  30.4  0.315  23  0

[767 rows x 9 columns]

In [28]:
df.groupby("6")[["72"]].mean()

           72
6
0   67.153153
1   67.792593
2   63.252427
3   66.586667
4   70.029412
5   76.210526
6   68.346939
7   70.777778
8   75.184211
9   77.892857
10  70.208333
11  74.181818
12  76.333333
13  73.800000
14  70.000000
15  70.000000
17  72.000000

In [29]:
df[10:20]

     6  148  72  35    0  33.6  0.627  50  1
10  10  168  74   0    0  38.0  0.537  34  1
11  10  139  80   0    0  27.1  1.441  57  0
12   1  189  60  23  846  30.1  0.398  59  1
13   5  166  72  19  175  25.8  0.587  51  1
14   7  100   0   0    0  30.0  0.484  32  1
15   0  118  84  47  230  45.8  0.551  31  1
16   7  107  74   0    0  29.6  0.254  31  1
17   1  103  30  38   83  43.3  0.183  33  0
18   1  115  70  30   96  34.6  0.529  32  1
19   3  126  88  41  235  39.3  0.704  27  0

In [30]:
df_6=df.groupby("6")
df_6.mean()

,148,72,35,0,33.6,0.627,50,1
6,,,,,,,,
0,123.000000,67.153153,22.270270,81.675676,34.290090,0.520838,27.603604,0.342342
1,112.748148,67.792593,24.437037,98.674074,31.372593,0.486496,27.370370,0.214815
2,110.796117,63.252427,21.601942,85.844660,30.583495,0.491660,27.194175,0.184466
3,123.586667,66.586667,20.080000,87.453333,30.425333,0.432147,29.026667,0.360000
4,125.117647,70.029412,15.882353,69.441176,32.141176,0.446353,32.779412,0.338235
5,118.859649,76.210526,17.385965,57.298246,33.192982,0.396421,39.035088,0.368421
6,120.244898,68.346939,17.285714,64.877551,30.222449,0.425490,39.122449,0.306122
7,136.444444,70.777778,20.288889,84.466667,32.631111,0.443622,41.111111,0.555556
8,131.736842,75.184211,17.315789,92.815789,31.568421,0.504711,45.368421,0.578947
9,131.392857,77.892857,20.892857,62.428571,31.707143,0.550679,44.178571,0.642857
10,120.916667,70.208333,15.708333,34.791667,30.641667,0.454167,42.666667,0.416667
11,126.454545,74.181818,21.727273,65.454545,38.563636,0.522545,44.545455,0.636364
12,113.555556,76.333333,27.111111,112.555556,32.344444,0.444333,47.444444,0.444444
13,125.500000,73.800000,17.300000,27.900000,35.000000,0.463300,44.500000,0.500000
14,137.500000,70.000000,27.500000,92.000000,35.100000,0.312000,42.000000,1.000000
15,136.000000,70.000000,32.000000,110.000000,37.100000,0.153000,43.000000,1.000000
17,163.000000,72.000000,41.000000,114.000000,40.900000,0.817000,47.000000,1.000000

In [31]:
df[["6","148"]]

      6  148
0     1   85
1     8  183
2     1   89
3     0  137
4     5  116
..   ..  ...
762  10  101
763   2  122
764   5  121
765   1  126
766   1   93

[767 rows x 2 columns]

In [32]:
df_35=df[df["35"]>30]
df_35

      6  148  72  35    0  33.6  0.627  50  1
3     0  137  40  35  168  43.1  2.288  33  1
5     3   78  50  32   88  31.0  0.248  26  1
7     2  197  70  45  543  30.5  0.158  53  1
15    0  118  84  47  230  45.8  0.551  31  1
17    1  103  30  38   83  43.3  0.183  33  0
..   ..  ...  ..  ..  ...   ...    ...  .. ..
754   1  128  88  39  110  36.5  1.057  37  1
755   7  137  90  41    0  32.0  0.391  39  0
760   9  170  74  31    0  44.0  0.403  43  1
762  10  101  76  48  180  32.9  0.171  63  0
766   1   93  70  31    0  30.4  0.315  23  0

[237 rows x 9 columns]

In [33]:
import numpy as np
import pandas as pd
df=pd.read_csv(r"C:\Users\OJUS\OneDrive\Desktop\\DS\Data Set\PlayTennis.csv")

In [40]:
df

     Outlook Temperature Humidity    Wind Play Tennis
0      Sunny         Hot     High    Weak          No
1      Sunny         Hot     High  Strong          No
2   Overcast         Hot     High    Weak         Yes
3       Rain        Mild     High    Weak         Yes
4       Rain        Cool   Normal    Weak         Yes
5       Rain        Cool   Normal  Strong          No
6   Overcast        Cool   Normal  Strong         Yes
7      Sunny        Mild     High    Weak          No
8      Sunny        Cool   Normal    Weak         Yes
9       Rain        Mild   Normal    Weak         Yes
10     Sunny        Mild   Normal  Strong         Yes
11  Overcast        Mild     High  Strong         Yes
12  Overcast         Hot   Normal    Weak         Yes
13      Rain        Mild     High  Strong          No

In [41]:
df.Wind

0       Weak
1     Strong
2       Weak
3       Weak
4       Weak
5     Strong
6     Strong
7       Weak
8       Weak
9       Weak
10    Strong
11    Strong
12      Weak
13    Strong
Name: Wind, dtype: object

In [42]:
df.describe()

       Outlook Temperature Humidity  Wind Play Tennis
count       14          14       14    14          14
unique       3           3        2     2           2
top       Rain        Mild   Normal  Weak         Yes
freq         5           6        7     8           9

In [45]:
df.max()

Outlook         Sunny
Temperature      Mild
Humidity       Normal
Wind             Weak
Play Tennis       Yes
dtype: object

In [46]:
df.min()

Outlook        Overcast
Temperature        Cool
Humidity           High
Wind             Strong
Play Tennis          No
dtype: object

In [44]:
df.dropna()

     Outlook Temperature Humidity    Wind Play Tennis
0      Sunny         Hot     High    Weak          No
1      Sunny         Hot     High  Strong          No
2   Overcast         Hot     High    Weak         Yes
3       Rain        Mild     High    Weak         Yes
4       Rain        Cool   Normal    Weak         Yes
5       Rain        Cool   Normal  Strong          No
6   Overcast        Cool   Normal  Strong         Yes
7      Sunny        Mild     High    Weak          No
8      Sunny        Cool   Normal    Weak         Yes
9       Rain        Mild   Normal    Weak         Yes
10     Sunny        Mild   Normal  Strong         Yes
11  Overcast        Mild     High  Strong         Yes
12  Overcast         Hot   Normal    Weak         Yes
13      Rain        Mild     High  Strong          No

In [35]:
df.groupby("Play Tennis")[["Outlook"]].describe()

            Outlook
              count unique       top freq
Play Tennis
No                5      2     Sunny    3
Yes               9      3  Overcast    4

In [36]:
df[1:11]

     Outlook Temperature Humidity    Wind Play Tennis
1      Sunny         Hot     High  Strong          No
2   Overcast         Hot     High    Weak         Yes
3       Rain        Mild     High    Weak         Yes
4       Rain        Cool   Normal    Weak         Yes
5       Rain        Cool   Normal  Strong          No
6   Overcast        Cool   Normal  Strong         Yes
7      Sunny        Mild     High    Weak          No
8      Sunny        Cool   Normal    Weak         Yes
9       Rain        Mild   Normal    Weak         Yes
10     Sunny        Mild   Normal  Strong         Yes

In [37]:
df_wind=df.groupby("Wind")
df_wind.describe()

       Outlook                    Temperature                   Humidity  \
         count unique    top freq       count unique   top freq    count
Wind
Strong       6      3   Rain    2           6      3  Mild    3        6
Weak         8      3  Sunny    3           8      3   Hot    3        8

                         Play Tennis
       unique   top freq       count unique  top freq
Wind
Strong      2  High    3           6      2  Yes    3
Weak        2  High    4           8      2  Yes    6

In [38]:
df[["Outlook","Temperature"]]

     Outlook Temperature
0      Sunny         Hot
1      Sunny         Hot
2   Overcast         Hot
3       Rain        Mild
4       Rain        Cool
5       Rain        Cool
6   Overcast        Cool
7      Sunny        Mild
8      Sunny        Cool
9       Rain        Mild
10     Sunny        Mild
11  Overcast        Mild
12  Overcast         Hot
13      Rain        Mild

In [39]:
df_temp=df[df["Temperature"]=="Hot"]
df_temp

     Outlook Temperature Humidity    Wind Play Tennis
0      Sunny         Hot     High    Weak          No
1      Sunny         Hot     High  Strong          No
2   Overcast         Hot     High    Weak         Yes
12  Overcast         Hot   Normal    Weak         Yes

In [40]:
import numpy as np
import pandas as pd
df=pd.read_csv(r"C:\Users\OJUS\OneDrive\Desktop\\DS\Data Set\salaries_final.csv")

In [48]:
df

,Year,Name,Primary Job Title,Base Pay,Department,College
0,2010,"Abaied, Jamie L.",Assistant Professor,64000.0,Department of Psychological Science,CAS
1,2011,"Abaied, Jamie L.",Assistant Professor,64000.0,Department of Psychological Science,CAS
2,2012,"Abaied, Jamie L.",Assistant Professor,65229.0,Department of Psychological Science,CAS
3,2013,"Abaied, Jamie L.",Assistant Professor,66969.0,Department of Psychological Science,CAS
4,2014,"Abaied, Jamie L.",Assistant Professor,68658.0,Department of Psychological Science,CAS
...,...,...,...,...,...,...
14465,2016,"van der Vliet, Albert",Professor,163635.0,Department of Pathology&Laboratory Medicine,COM
14466,2017,"van der Vliet, Albert",Professor,175294.0,Department of Pathology&Laboratory Medicine,COM
14467,2018,"van der Vliet, Albert",Professor,191000.0,Department of Pathology&Laboratory Medicine,COM
14468,2019,"van der Vliet, Albert",Professor,196000.0,Department of Pathology&Laboratory Medicine,COM
14469,2020,"van der Vliet, Albert",Professor,186200.0,Department of Pathology&Laboratory Medicine,COM

In [50]:
df.Year

0        2010
1        2011
2        2012
3        2013
4        2014
         ...
14465    2016
14466    2017
14467    2018
14468    2019
14469    2020
Name: Year, Length: 14470, dtype: int64

In [51]:
df.describe()

               Year       Base Pay
count  14470.000000   14470.000000
mean    2015.382308   70986.426381
std        3.373690   47287.464370
min     2009.000000    1707.000000
25%     2013.000000   35000.000000
50%     2016.000000   63550.000000
75%     2018.000000   90529.250000
max     2020.000000  446429.000000

In [52]:
df.max()

Year                                         2020
Name                        van der Vliet, Albert
Primary Job Title               Visiting Lecturer
Base Pay                                 446429.0
Department           Rubenstein Sch Env & Nat Res
College                                     RSENR
dtype: object

In [53]:
df.min()

Year                                         2009
Name                             Abaied, Jamie L.
Primary Job Title     Academic Srvcs Professional
Base Pay                                   1707.0
Department           Department of Anesthesiology
College                                  Business
dtype: object

In [54]:
df.mean()

Year         2015.382308
Base Pay    70986.426381
dtype: float64

In [55]:
df.median()

Year         2016.0
Base Pay    63550.0
dtype: float64

In [56]:
df.std()

Year            3.37369
Base Pay    47287.46437
dtype: float64

In [57]:
df.dropna()

,Year,Name,Primary Job Title,Base Pay,Department,College
0,2010,"Abaied, Jamie L.",Assistant Professor,64000.0,Department of Psychological Science,CAS
1,2011,"Abaied, Jamie L.",Assistant Professor,64000.0,Department of Psychological Science,CAS
2,2012,"Abaied, Jamie L.",Assistant Professor,65229.0,Department of Psychological Science,CAS
3,2013,"Abaied, Jamie L.",Assistant Professor,66969.0,Department of Psychological Science,CAS
4,2014,"Abaied, Jamie L.",Assistant Professor,68658.0,Department of Psychological Science,CAS
...,...,...,...,...,...,...
14465,2016,"van der Vliet, Albert",Professor,163635.0,Department of Pathology&Laboratory Medicine,COM
14466,2017,"van der Vliet, Albert",Professor,175294.0,Department of Pathology&Laboratory Medicine,COM
14467,2018,"van der Vliet, Albert",Professor,191000.0,Department of Pathology&Laboratory Medicine,COM
14468,2019,"van der Vliet, Albert",Professor,196000.0,Department of Pathology&Laboratory Medicine,COM
14469,2020,"van der Vliet, Albert",Professor,186200.0,Department of Pathology&Laboratory Medicine,COM

In [58]:
df['Year']

0        2010
1        2011
2        2012
3        2013
4        2014
         ...
14465    2016
14466    2017
14467    2018
14468    2019
14469    2020
Name: Year, Length: 14470, dtype: int64

In [59]:
df['Year'].dtype

dtype('int64')

In [60]:
df.dtypes

Year                   int64
Name                  object
Primary Job Title     object
Base Pay             float64
Department            object
College               object
dtype: object

In [61]:
df.columns

Index(['Year', 'Name', 'Primary Job Title', 'Base Pay', 'Department',
       'College'],
      dtype='object')

In [62]:
df.axes

[RangeIndex(start=0, stop=14470, step=1),
 Index(['Year', 'Name', 'Primary Job Title', 'Base Pay', 'Department',
        'College'],
       dtype='object')]

In [63]:
df.ndim

2

In [65]:
df.size

86820

In [66]:
df.shape

(14470, 6)

In [67]:
df.values

array([[2010, 'Abaied, Jamie L.', 'Assistant Professor', 64000.0,
        'Department of Psychological Science', 'CAS'],
       [2011, 'Abaied, Jamie L.', 'Assistant Professor', 64000.0,
        'Department of Psychological Science', 'CAS'],
       [2012, 'Abaied, Jamie L.', 'Assistant Professor', 65229.0,
        'Department of Psychological Science', 'CAS'],
       ...,
       [2018, 'van der Vliet, Albert', 'Professor', 191000.0,
        'Department of Pathology&Laboratory Medicine', 'COM'],
       [2019, 'van der Vliet, Albert', 'Professor', 196000.0,
        'Department of Pathology&Laboratory Medicine', 'COM'],
       [2020, 'van der Vliet, Albert', 'Professor', 186200.0,
        'Department of Pathology&Laboratory Medicine', 'COM']],
      dtype=object)

In [41]:
df.groupby("Name")[["Base Pay"]].mean()

                                     Base Pay
Name
Abaied, Jamie L.                 71838.095455
Abajian, Michael John            39014.299000
Abajian, Michelle A              48000.000000
Abbott, John D.                  49446.227273
Abdul-Karim, Yasmeen             30000.000000
...                                       ...
deLaBruere, Lucie Y.              5253.000000
deRosset, Louis H.               83190.750000
van den Berg, Abby Katrien       78488.601667
van den Broek-Altenburg, Eline  115966.666667
van der Vliet, Albert           162578.166667

[2047 rows x 1 columns]

In [42]:
df[10:20]

,Year,Name,Primary Job Title,Base Pay,Department,College
10,2020,"Abaied, Jamie L.",Associate Professor,86934.00,Department of Psychological Science,CAS
11,2011,"Abajian, Michael John",Lecturer,5000.00,Department of Nursing,CNHS
12,2012,"Abajian, Michael John",Lecturer,5101.00,Department of Nursing,CNHS
13,2013,"Abajian, Michael John",Lecturer,40580.00,Department of Nursing,CNHS
14,2014,"Abajian, Michael John",Lecturer,41972.00,Department of Nursing,CNHS
15,2015,"Abajian, Michael John",Lecturer,43786.00,Department of Nursing,CNHS
16,2016,"Abajian, Michael John",Lecturer,47344.99,Department of Nursing,CNHS
17,2017,"Abajian, Michael John",Lecturer,47345.00,Department of Nursing,CNHS
18,2018,"Abajian, Michael John",Lecturer,51790.00,Department of Nursing,CNHS
19,2019,"Abajian, Michael John",Lecturer,53612.00,Department of Nursing,CNHS

In [43]:
df_bp=df.groupby("Base Pay")
df_bp.max()

,Year,Name,Primary Job Title,Department,College
Base Pay,,,,,
1707.00,2019,"Wilson, Jennifer E",Lecturer I,Department of Mathematics & Statistics,CEMS
1737.00,2015,"Lamore, Tricia Jean",Lecturer,Department of Biomedical and Health Sci,CNHS
1772.00,2018,"Lamore, Tricia Jean",Lecturer,Department of Biomedical and Health Sci,CNHS
1804.00,2016,"Ringler, Sarah Rose",Lecturer,Department of Psychological Science,CAS
1862.00,2016,"Thompson, Ethan N.",Lecturer,Department of Plant Biology,CALS
...,...,...,...,...,...
427673.00,2019,"Stein, Gary Stephen",Professor,Department of Biochemistry,CAS
429093.00,2015,"Sullivan, E. Thomas",President,Department of Political Science,CAS
437674.86,2016,"Sullivan, E. Thomas",President,Department of Political Science,CAS
437675.00,2017,"Sullivan, E. Thomas",President,Department of Political Science,CAS
446429.00,2018,"Sullivan, E. Thomas",President,Department of Political Science,CAS

In [44]:
df[["Year","Name"]]

       Year                   Name
0      2010       Abaied, Jamie L.
1      2011       Abaied, Jamie L.
2      2012       Abaied, Jamie L.
3      2013       Abaied, Jamie L.
4      2014       Abaied, Jamie L.
...     ...                    ...
14465  2016  van der Vliet, Albert
14466  2017  van der Vliet, Albert
14467  2018  van der Vliet, Albert
14468  2019  van der Vliet, Albert
14469  2020  van der Vliet, Albert

[14470 rows x 2 columns]

In [46]:
df_bp=df[df["Base Pay"]>80000]
df_bp

,Year,Name,Primary Job Title,Base Pay,Department,College
8,2018,"Abaied, Jamie L.",Associate Professor,84603.00,Department of Psychological Science,CAS
10,2020,"Abaied, Jamie L.",Associate Professor,86934.00,Department of Psychological Science,CAS
90,2014,"Acquisto, Joseph T.",Professor,87532.00,Department of Romance Languages,CAS
91,2015,"Acquisto, Joseph T.",Professor,90415.00,Department of Romance Languages,CAS
92,2016,"Acquisto, Joseph T.",Professor,109375.25,Department of Romance Languages,CAS
...,...,...,...,...,...,...
14465,2016,"van der Vliet, Albert",Professor,163635.00,Department of Pathology&Laboratory Medicine,COM
14466,2017,"van der Vliet, Albert",Professor,175294.00,Department of Pathology&Laboratory Medicine,COM
14467,2018,"van der Vliet, Albert",Professor,191000.00,Department of Pathology&Laboratory Medicine,COM
14468,2019,"van der Vliet, Albert",Professor,196000.00,Department of Pathology&Laboratory Medicine,COM
14469,2020,"van der Vliet, Albert",Professor,186200.00,Department of Pathology&Laboratory Medicine,COM